estanislaocrivos/CESE_TSSE_TP3/build/test/mocks/mock_PIC18F57K42_UART1.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_PIC18F57K42_UART1_H
#define _MOCK_PIC18F57K42_UART1_H

#include "unity.h"
#include "PIC18F57K42_UART1.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

void mock_PIC18F57K42_UART1_Init(void);
void mock_PIC18F57K42_UART1_Destroy(void);
void mock_PIC18F57K42_UART1_Verify(void);




#define PIC18F57K42_UART1_Initialize_IgnoreAndReturn(cmock_retval) PIC18F57K42_UART1_Initialize_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Initialize_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
#define PIC18F57K42_UART1_Initialize_StopIgnore() PIC18F57K42_UART1_Initialize_CMockStopIgnore()
void PIC18F57K42_UART1_Initialize_CMockStopIgnore(void);
#define PIC18F57K42_UART1_Initialize_ExpectAndReturn(cmock_retval) PIC18F57K42_UART1_Initialize_CMockExpectAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Initialize_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
typedef uint8_t (* CMOCK_PIC18F57K42_UART1_Initialize_CALLBACK)(int cmock_num_calls);
void PIC18F57K42_UART1_Initialize_AddCallback(CMOCK_PIC18F57K42_UART1_Initialize_CALLBACK Callback);
void PIC18F57K42_UART1_Initialize_Stub(CMOCK_PIC18F57K42_UART1_Initialize_CALLBACK Callback);
#define PIC18F57K42_UART1_Initialize_StubWithCallback PIC18F57K42_UART1_Initialize_Stub
#define PIC18F57K42_UART1_Transmit_Byte_IgnoreAndReturn(cmock_retval) PIC18F57K42_UART1_Transmit_Byte_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Transmit_Byte_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
#define PIC18F57K42_UART1_Transmit_Byte_StopIgnore() PIC18F57K42_UART1_Transmit_Byte_CMockStopIgnore()
void PIC18F57K42_UART1_Transmit_Byte_CMockStopIgnore(void);
#define PIC18F57K42_UART1_Transmit_Byte_ExpectAndReturn(Byte_To_Transmit, cmock_retval) PIC18F57K42_UART1_Transmit_Byte_CMockExpectAndReturn(__LINE__, Byte_To_Transmit, cmock_retval)
void PIC18F57K42_UART1_Transmit_Byte_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t Byte_To_Transmit, uint8_t cmock_to_return);
typedef uint8_t (* CMOCK_PIC18F57K42_UART1_Transmit_Byte_CALLBACK)(uint8_t Byte_To_Transmit, int cmock_num_calls);
void PIC18F57K42_UART1_Transmit_Byte_AddCallback(CMOCK_PIC18F57K42_UART1_Transmit_Byte_CALLBACK Callback);
void PIC18F57K42_UART1_Transmit_Byte_Stub(CMOCK_PIC18F57K42_UART1_Transmit_Byte_CALLBACK Callback);
#define PIC18F57K42_UART1_Transmit_Byte_StubWithCallback PIC18F57K42_UART1_Transmit_Byte_Stub
#define PIC18F57K42_UART1_Receive_Byte_IgnoreAndReturn(cmock_retval) PIC18F57K42_UART1_Receive_Byte_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Receive_Byte_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
#define PIC18F57K42_UART1_Receive_Byte_StopIgnore() PIC18F57K42_UART1_Receive_Byte_CMockStopIgnore()
void PIC18F57K42_UART1_Receive_Byte_CMockStopIgnore(void);
#define PIC18F57K42_UART1_Receive_Byte_ExpectAndReturn(Received_Byte, cmock_retval) PIC18F57K42_UART1_Receive_Byte_CMockExpectAndReturn(__LINE__, Received_Byte, cmock_retval)
void PIC18F57K42_UART1_Receive_Byte_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t* Received_Byte, uint8_t cmock_to_return);
typedef uint8_t (* CMOCK_PIC18F57K42_UART1_Receive_Byte_CALLBACK)(uint8_t* Received_Byte, int cmock_num_calls);
void PIC18F57K42_UART1_Receive_Byte_AddCallback(CMOCK_PIC18F57K42_UART1_Receive_Byte_CALLBACK Callback);
void PIC18F57K42_UART1_Receive_Byte_Stub(CMOCK_PIC18F57K42_UART1_Receive_Byte_CALLBACK Callback);
#define PIC18F57K42_UART1_Receive_Byte_StubWithCallback PIC18F57K42_UART1_Receive_Byte_Stub
#define PIC18F57K42_UART1_Transmit_Word_IgnoreAndReturn(cmock_retval) PIC18F57K42_UART1_Transmit_Word_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Transmit_Word_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
#define PIC18F57K42_UART1_Transmit_Word_StopIgnore() PIC18F57K42_UART1_Transmit_Word_CMockStopIgnore()
void PIC18F57K42_UART1_Transmit_Word_CMockStopIgnore(void);
#define PIC18F57K42_UART1_Transmit_Word_ExpectAndReturn(Word_To_Transmit, cmock_retval) PIC18F57K42_UART1_Transmit_Word_CMockExpectAndReturn(__LINE__, Word_To_Transmit, cmock_retval)
void PIC18F57K42_UART1_Transmit_Word_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint16_t Word_To_Transmit, uint8_t cmock_to_return);
typedef uint8_t (* CMOCK_PIC18F57K42_UART1_Transmit_Word_CALLBACK)(uint16_t Word_To_Transmit, int cmock_num_calls);
void PIC18F57K42_UART1_Transmit_Word_AddCallback(CMOCK_PIC18F57K42_UART1_Transmit_Word_CALLBACK Callback);
void PIC18F57K42_UART1_Transmit_Word_Stub(CMOCK_PIC18F57K42_UART1_Transmit_Word_CALLBACK Callback);
#define PIC18F57K42_UART1_Transmit_Word_StubWithCallback PIC18F57K42_UART1_Transmit_Word_Stub
#define PIC18F57K42_UART1_Receive_Word_IgnoreAndReturn(cmock_retval) PIC18F57K42_UART1_Receive_Word_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void PIC18F57K42_UART1_Receive_Word_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint8_t cmock_to_return);
#define PIC18F57K42_UART1_Receive_Word_StopIgnore() PIC18F57K42_UART1_Receive_Word_CMockStopIgnore()
void PIC18F57K42_UART1_Receive_Word_CMockStopIgnore(void);
#define PIC18F57K42_UART1_Receive_Word_ExpectAndReturn(Receieved_Word, cmock_retval) PIC18F57K42_UART1_Receive_Word_CMockExpectAndReturn(__LINE__, Receieved_Word, cmock_retval)
void PIC18F57K42_UART1_Receive_Word_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint16_t* Receieved_Word, uint8_t cmock_to_return);
typedef uint8_t (* CMOCK_PIC18F57K42_UART1_Receive_Word_CALLBACK)(uint16_t* Receieved_Word, int cmock_num_calls);
void PIC18F57K42_UART1_Receive_Word_AddCallback(CMOCK_PIC18F57K42_UART1_Receive_Word_CALLBACK Callback);
void PIC18F57K42_UART1_Receive_Word_Stub(CMOCK_PIC18F57K42_UART1_Receive_Word_CALLBACK Callback);
#define PIC18F57K42_UART1_Receive_Word_StubWithCallback PIC18F57K42_UART1_Receive_Word_Stub

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
